tutorials/inhomogenousTurbulence/SEM/channel395/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (20 0 0)
    (0 1 0)
    (20 1 0)
    (0 2 0)
    (20 2 0)
    (0 0 2)
    (20 0 2)
    (0 1 2)
    (20 1 2)
    (0 2 2)
    (20 2 2)
);

blocks
(
    hex (0 1 3 2 6 7 9 8)   (400 25 40) simpleGrading (1  10.7028 1)
    hex (2 3 5 4 8 9 11 10) (400 25 40) simpleGrading (1   0.0934 1)
);

edges
(
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 1 7 6));
    }
    topWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }

    sides1_half0
    {
        type            cyclic;
        neighbourPatch  sides1_half1;
        faces           ((0 2 3 1));
    }
    sides1_half1
    {
        type            cyclic;
        neighbourPatch  sides1_half0;
        faces           ((6 7 9 8));
    }

    sides2_half0
    {
        type            cyclic;
        neighbourPatch  sides2_half1;
        faces           ((2 4 5 3));
    }
    sides2_half1
    {
        type            cyclic;
        neighbourPatch  sides2_half0;
        faces           ((8 9 11 10));
    }

    inlet
    {
        type            patch;
        faces           ((0 6 8 2) (2 8 10 4));
    }

    outlet
    {
        type            patch;
        faces           ((1 3 9 7) (3 5 11 9));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
